wallet/app/controllers/wallets_controller.rb

  def index
    @wallets = Wallet.all
---
SELECT "wallets".* FROM "wallets"

  def create
    @wallet = Wallet.new(wallet_params)

    respond_to do |format|
      if @wallet.save
---
INSERT INTO "wallets" ("item", "cost", "paid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item", "アイス"], ["cost", 200], ["paid", "t"], ["created_at", "2017-06-04 09:49:21.343011"], ["updated_at", "2017-06-04 09:49:21.343011"]]

  def update
    respond_to do |format|
      if @wallet.update(wallet_params)
---
UPDATE "wallets" SET "paid" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["paid", "f"], ["updated_at", "2017-06-04 09:51:50.362022"], ["id", 1]]

  def destroy
    @wallet.destroy
---
DELETE FROM "wallets" WHERE "wallets"."id" = $1  [["id", 2]]

    def set_wallet
      @wallet = Wallet.find(params[:id])
---
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]